{
  "backend/main.mo": "Motoko canister managing announcements, events, and inquiries with create and query functions using in‑memory maps and timestamp‑based sorting.",
  "feature_evidence.json": "Placeholder feature evidence report with an empty features array.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including pages, hooks, and configuration.",
  "frontend/DEPLOYMENT.md": "Deployment guide outlining prerequisites, asset checks, and steps for deploying to the IC mainnet.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark themes and applying global styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/scripts/smoke-test.mjs": "Node script performing smoke tests on critical routes and assets for production deployments.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for Home, Learn More, and Special Event pages.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying logo, quick links, contact details, and caffeine.ai attribution using assetUrl.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo and navigation links, including mobile menu via Sheet.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout wrapping pages with Header, content outlet, and Footer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useContactForm.ts": "Empty file.",
  "frontend/src/hooks/useDocumentTitle.ts": "Sets the browser document title whenever the given title changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and AuthClient configuration.",
  "frontend/src/hooks/useNewsEvents.ts": "Empty file.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark theme variables and typography rules.",
  "frontend/src/lib/assetUrl.ts": "Builds correct asset URLs using Vite’s BASE_URL for dev and production.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Empty file.",
  "frontend/src/pages/Academics.tsx": "Empty file.",
  "frontend/src/pages/Admissions.tsx": "Empty file.",
  "frontend/src/pages/AnnouncementDetail.tsx": "Empty file.",
  "frontend/src/pages/Contact.tsx": "Empty file.",
  "frontend/src/pages/EventDetail.tsx": "Empty file.",
  "frontend/src/pages/Home.tsx": "Home page with hero section, highlights, and academic year info using styled components and asset images.",
  "frontend/src/pages/LearnMore.tsx": "Learn More page describing the school’s mission, features, and facilities.",
  "frontend/src/pages/NewsEvents.tsx": "Empty file.",
  "frontend/src/pages/SpecialEvent.tsx": "Special Event page detailing an annual fete with date, location, and invitation information.",
  "frontend/src/pages/StaffFaculty.tsx": "Empty file.",
  "frontend/src/pages/StudentLife.tsx": "Empty file.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s state, scope, requirements, branding details, and planned features for the school website."
}