{
  "backend/main.mo": "Motoko backend defining announcement, event, and inquiry types with CRUD-style create and query functions using Maps and timestamps.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests related to deployment and smoke‑testing of the site.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files including pages, hooks, layout components, and utilities.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing prerequisites, asset checks, and steps for deploying the app to the Internet Computer mainnet.",
  "frontend/index.css": "CSS file establishing Tailwind layers and OKLCH-based theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React app via main.tsx.",
  "frontend/scripts/smoke-test.mjs": "Node script performing smoke tests on production deployment by checking key routes and assets.",
  "frontend/src/App.tsx": "Main React entry configuring TanStack Router with routes for Home, Learn More, and Special Event.",
  "frontend/src/components/layout/Footer.tsx": "Footer component showing logo, quick links, contact info, and caffeine.ai attribution.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, desktop navigation, and mobile sheet menu for key site routes.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper combining Header, Outlet, and Footer for all pages.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useContactForm.ts": "Empty file.",
  "frontend/src/hooks/useDocumentTitle.ts": "Sets the browser document title whenever the provided title changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication via Internet Identity, providing identity state, login, logout, and status through a React context provider.",
  "frontend/src/hooks/useNewsEvents.ts": "Empty file.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and custom CSS variables for light and dark themes.",
  "frontend/src/lib/assetUrl.ts": "Generates correct asset URLs by combining a normalized path with Vite's BASE_URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/About.tsx": "Empty file.",
  "frontend/src/pages/Academics.tsx": "Empty file.",
  "frontend/src/pages/Admissions.tsx": "Empty file.",
  "frontend/src/pages/AnnouncementDetail.tsx": "Empty file.",
  "frontend/src/pages/Contact.tsx": "Empty file.",
  "frontend/src/pages/EventDetail.tsx": "Empty file.",
  "frontend/src/pages/Home.tsx": "Home page showing hero content, school highlights, academic year info, and navigation buttons.",
  "frontend/src/pages/LearnMore.tsx": "Learn More page describing school mission, features, and facilities with styled content sections.",
  "frontend/src/pages/NewsEvents.tsx": "Empty file.",
  "frontend/src/pages/SpecialEvent.tsx": "Special Event page detailing date, location, and information for the Annual Fete 2026.",
  "frontend/src/pages/StaffFaculty.tsx": "Empty file.",
  "frontend/src/pages/StudentLife.tsx": "Empty file.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state and requirements for a minimal three-page school website with branding, event details, and contact info."
}